import React from 'react'

//  bookstore

// 백엔드/데이터베이스 협업
// API 작성 (Application Programming InterFace)

// API 명세 작성

// RESTful API

// 자원(Resource)의 식별
// 자원의 상태 처리 방법 (HTTP 메소드)
// POST: 새로운 자원을 생성
// GET: 자원을 조화
// PUT: 자원의 전체를 갱신
// PATCH: 자원의 일부를 갱신
// DELETE: 자원을 삭제
export default function Index() {
  return (
   <>
  


   </>
  )
}

// bookstore 프로젝트 구성

// 전체 페이지 구성

//! 1. 메인 페이지(홈 화면)
// - 헤더, 네비, 메인, 푸터
// - 헤더: 가운데 로고, 우측: 로그인, 회원가입 (로그인 시 회원 정보를 출력)
// - 메인: 책을 랜덤으로 불러와서 슬라이드 형식으로 출력
// - top5 기능
// - 푸터: 회사 연혁, 소개

//! 2. 로그인 & 회원가입

//! 3. 책 목록(책 리스트, 상세페이지)
// - 데이터베이스에서 책 리스트를 배열 형식으로 출력

//! 4. 구매 화면 

//! 5. 공지사항 화면(추가, 확인, 수정, 삭제)

//? 마이페이지

//? 사이드바

//? 장바구니